#!/etc/bin/python3
#-*- coding:UTF-8 -*-
#企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

I=input('请输入当月利润:')

def bonus(x):
    if x<=100000:
        x=x*0.1
    if x>100000 and x<=200000:
        x=100000*0.1+(x-100000)*0.075
    if x>200000 and x<=400000:
        x=100000*0.1+100000*0.075+(x-200000)*0.05
    if x>400000 and x<=600000:
        x=100000*0.1+100000*0.075+200000*0.05+(x-400000)*0.03
    if x>600000 and x<=1000000:
        x=100000*0.1+100000*0.075+200000*0.05+200000*0.03+(x-600000)*0.015
    if x>1000000:
        x=100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+(x-1000000)*0.01
    return x

print('应发放奖金总数：',bonus(int(I)))
